{
    "1": {
        "requirement": "Error Highlighting",
        "category": "3",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "High",
        "subsystems": "Video analysis, UI",
        "target version": "0.1",
        "eligibility criteria": "-",
        "description": "Error highlighting is one of the most crucial features of VTrainer. The goal of the product is to help our customer detect mistakes in their trainings and to achieve result they desire.",
        "stimulus_responce": "In first, one should record video of their training. This can be achieved through our app by opening camera interface from main screen of the app. After finishing training one should stop recording and confirm video analysis. After completing analysis VTrainer will notify person and user can watch analysed video with highlighted errors.",
        "functional_requirements": "In addition to the ability to record and store video needed for this feature VTrainer system must have deep learning model to analyse given video in order to extract one's body position and transform it to a set of vertexes. After such process these vertexes should be analysed and compared with the perfect excercise example, prebuilt in the system, and all of the errors made by a user should be rendered to the video and displayed back with some explanations of what have been done wrong."
    },
    "2": {
        "requirement": "Error Notification",
        "category": "3",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "High",
        "subsystems": "UI",
        "target version": "0.2",
        "eligibility criteria": "-",
        "description": "Error notification is zero-delay notification feature about errors made during excercise. VTrainer will notify excercising person about all the errors made through the one of predetermined notification channels (audio signals, flashlight, fitness bracelet vibrations, etc).",
        "stimulus_responce": "One can enable this feature at a video recording stage. After starting the excercise user will receive notifications about made mistakes which can be ignored without any consequences.",
        "functional_requirements": "This feature uses the same deep learning model and vertex analyzation algorithms as error highlightning feature, but processes video in a real time and transmits error's information to notification API instead of rendering it on top of existing video. Due to high computational capabilities of the one's device, this feature restraints the set of appropriate devices."
    },
    "3": {
        "requirement": "Individual Training Program",
        "category": "3",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "Normal",
        "subsystems": "-",
        "target version": "0.2",
        "eligibility criteria": "-",
        "description": "The goal of this feature is to suggest an optimal set of excercises and their tension depending on the current parameters of one's body and the history of previous trainings.",
        "stimulus_responce": "On the first launch of VTrainer user will be prompted to calibrate app's understanding about user's capababilities in certain excercises (pushups, pullups, squats, etc). After that VTrainer will be able to propose different training programs to user. After every excercise app will adjust some parameters depending on user's progress. Additionally there will be opportunity to recalibrate current data in settings menu.",
        "functional_requirements": "In order to implement this feature we should develop a system that will generate new training programs depending on user's physical metrics and recent trainings. We should also research modern fitness and sport techniques and consult with professionals to get all the information needed for this system"
    },
    "4": {
        "requirement": "Instructional Videos",
        "category": "3",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "Normal",
        "subsystems": "-",
        "target version": "0.3",
        "eligibility criteria": "-",
        "description": "Set of instructional videos shall provide some of the basic and advanced understandings about certain exercises.",
        "stimulus_responce": "Instructional videos will be divided to a sections corresponding to a class of exercise (legs, arms, cardio, etc). In every section there will be a list of exercises with a few tutorial videos about them. After watching all videos about certain exercise, user will be prompted to consolidate their knowledge by doing this exercise.",
        "functional_requirements": "This feature requires recommendations from qualified fitness trainers and sportsmen. After finding those instructors we should be able to decide which of all possible exercices we should explain to a user. After that we will record a set of lessons for every exercise we took and add them to the app interface."
    },
    "5": {
        "requirement": "Achievement System",
        "category": "3",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "Modern trends towards gamification",
        "status": "Approved",
        "priority": "Normal",
        "subsystems": "UI",
        "target version": "0.3",
        "eligibility criteria": "-",
        "description": "Statistics and achievement system will provide some aspects of gamification and will help user to stay motivated for a long time and be proud of their progress.",
        "stimulus_responce": "User can get all available information about statistics and achievements through the main screen of the app. All data needed will be calculated after one's excercise and user will be notified about their achievements if they got any.",
        "functional_requirements": "To add this feature we need to decide which metrics we should track and which achievements should be added. Then we need to draw icons for all of the achievements and add all the functionality to track those metrics. All of the user's statistics and achievements will be stored in a cloud data center and will be synchronized with it to allow our users to save their progress and retreive it in case of losing their device."
    },
    "6": {
        "requirement": "External Services Integration",
        "category": "3",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "User requirements",
        "status": "Approved",
        "priority": "Normal",
        "subsystems": "UI",
        "target version": "0.3",
        "eligibility criteria": "-",
        "description": "External services intergration catches up to a modern approach of simplified registration and login processes and allows our users to share their achievements on desired platforms.",
        "stimulus_responce": "Upon first launch of VTrainer user will be prompted to login to system either existing account or create a new account through the existing one. They can also do it later through the special account menu on a main screen of the app. Also user can share their achievements and compare their progress to either friends or worldwide audience.",
        "functional_requirements": "Feature requires development of a login/registration functionality depending on platform's API and their policies. It also needs the ability to retrieve user's friends list, support worldwide rankings and ability to post news through plarform's API."
    },
    "7": {
        "requirement": "Customer Support",
        "category": "3",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "User requirements",
        "status": "Approved",
        "priority": "Normal",
        "subsystems": "UI",
        "target version": "1.0",
        "eligibility criteria": "-",
        "description": "This feature allows users to contact the support service to get help with their trainings, application errors and other issues.",
        "stimulus_responce": "This feature can be accessed through the main screen of the application. User should pick request category first and then describe their problem in a dialog box.",
        "functional_requirements": "This feature needs additional API in our servers along with qualified support team which should include tech specialists and sport/fitness professionals. "
    },
    "8": {
        "requirement": "Target Operating System",
        "category": "5a",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "High",
        "subsystems": "-",
        "target version": "0.1",
        "eligibility criteria": "-",
        "description": "Due to specific system's API needed and device's computational requirements user's device should be operated by iOS 13+ or Android 7+."
    },
    "9": {
        "requirement": "Target RPS",
        "category": "5a",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "High",
        "subsystems": "-",
        "target version": "0.2",
        "eligibility criteria": "-",
        "description": "Project's backend system should be able to sustain at least 200 RPS in first three months after product launch."
    },
    "10": {
        "requirement": "Indirect Data Access",
        "category": "5c",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "High",
        "subsystems": "-",
        "target version": "0.1",
        "eligibility criteria": "-",
        "description": "Any data stored should be protected from anyone's direct access including developers."
    },
    "11": {
        "requirement": "Low Power Consumption",
        "category": "5a",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "Normal",
        "subsystems": "-",
        "target version": "0.2",
        "eligibility criteria": "-",
        "description": "Application should not consume more energy than necessary for its proper functioning. High energy consumption is always one of the main factors to uninstall an application."
    },
    "12": {
        "requirement": "Proper Functioning with no Internet Access",
        "category": "5a",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "Normal",
        "subsystems": "-",
        "target version": "0.2",
        "eligibility criteria": "-",
        "description": "Application should be able to provide most of its features without Internet connection."
    },
    "13": {
        "requirement": "Application Permissions",
        "category": "6",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "Normal",
        "subsystems": "-",
        "target version": "0.2",
        "eligibility criteria": "-",
        "description": "Our app should not request more device's permissions than necessary. Designing features that will extend current list of app's permissions is undesired."
    },
    "14": {
        "requirement": "Data Safety",
        "category": "5c",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "High",
        "subsystems": "-",
        "target version": "0.2",
        "eligibility criteria": "-",
        "description": "User data should be protected from unauthorized changes and thefts. All data should be encrypted and should be accessed only through system API."
    },
    "15": {
        "requirement": "User's Traumas",
        "category": "5b",
        "date": "23.02.2021",
        "author": "-",
        "revision number": "1",
        "person in charge": "-",
        "source": "-",
        "status": "Approved",
        "priority": "High",
        "subsystems": "-",
        "target version": "0.2",
        "eligibility criteria": "-",
        "description": "Company should not be responsible for any kind of traumas and other physical and moral damage caused during use of VTrainer. Despite this our goal is to minimize all of the possible risks of injuries. All training programs should be designed with a focus on its safety and the user should be informed about possible risks of unproper workouts."
    }
}
